package com.huatu.handheld_huatu.mvpmodel.essay;

public class CheckCountDetailBean {
    public long id;//订单详情ID
    public int bizStatus;//订单状态
    public String bizStatusName;//订单状态描述
    public int count;//数量
    public long expireDate;//具体过期的时长（毫秒）
    public long expireTime;//初始过期时长（毫秒）
    public int num;//剩余批改次数
    public int unit;//批改次数单位
    public int expireFlag;//0不会过期1有过期时间
    public int isLimitNum;//0不限次数1限定次数
    public String expireDateStr;//具体过期的时长（字符串
    public String memo;//课程赠送说明
    public String name;//产品名称
    public String orderNumStr;//订单编号
    public String payTime;//付款时间
    public String source;//订单来源


//    bizStatus	状态	number	@mock=$order(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
//    bizStatusName	状态名称	string	@mock=$order('未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付','未支付')
//    count	商品数量	number	@mock=$order(1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
//    expireDate	具体过期的时长（毫秒）	number	@mock=$order(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
//    expireDateStr	具体过期的时长（字符串）	string	@mock=$order('','','','','','','','','','','','','','','','','','','','')
//    expireFlag	0不会过期1有过期时间	number	@mock=$order(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
//    expireTime	初始过期时长	number	@mock=$order(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
//    id	订单详情ID	number	@mock=$order(1897,985,986,987,875,874,873,872,871,862,861,860,858,857,856,855,854,853,852,851)
//    isLimitNum	0不限次数1限定次数	number	@mock=$order(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
//    memo	订单备注（课程信息存在此处）	string	@mock=$order('','','','','','','','','','','','','','','','','','','','')
//    name	产品名称	string	@mock=$order('文章写作批改1次','zx测试勿动原价','单题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次','套题批改5次')
//    num	剩余批改次数	number	@mock=$order(1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
//    orderNumStr	订单编号	string	@mock=$order('ht201906202121156295','ht201803191654471776','ht201803191654471776','ht201803191654471776','ht201802281614311701','ht201802281612331501','ht20180228161039774','ht20180228160936773','ht20180228160930772','ht20180227194138764','ht20180227194134763','ht20180227193847762','ht20180227193402760','ht20180227193337759','ht20180227193203758','ht20180227193122757','ht20180227182558756','ht20180227182547755','ht20180227182143754','ht20180227181356753')
//    payTime	付款时间	number	@mock=$order('2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16','2019-06-20 21:21:16')
//    source	订单来源	string	@mock=$order('APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单','APP下单')
//    unit 批改次数单位	number	@mock=$order(1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
}
